Biosense-Capstone/SPIMASTER/CC1350_BIOSENSE_HEADSET.c
/*
 *  =============================== Crypto ===============================
 */
#include <ti/drivers/crypto/CryptoCC26XX.h>

CryptoCC26XX_Object cryptoCC26XXObjects[CC1350_BIOSENSE_HEADSET_CRYPTOCOUNT];

const CryptoCC26XX_HWAttrs cryptoCC26XXHWAttrs[CC1350_BIOSENSE_HEADSET_CRYPTOCOUNT] = {
    {
        .baseAddr       = CRYPTO_BASE,
        .powerMngrId    = PowerCC26XX_PERIPH_CRYPTO,
        .intNum         = INT_CRYPTO_RESULT_AVAIL_IRQ,
        .intPriority    = ~0,
    }
};

const CryptoCC26XX_Config CryptoCC26XX_config[CC1350_BIOSENSE_HEADSET_CRYPTOCOUNT] = {
    {
         .object  = &cryptoCC26XXObjects[CC1350_BIOSENSE_HEADSET_CRYPTO0],
         .hwAttrs = &cryptoCC26XXHWAttrs[CC1350_BIOSENSE_HEADSET_CRYPTO0]
    },
};

/*
 *  =============================== TRNG ===============================
 */
#include <ti/drivers/TRNG.h>
#include <ti/drivers/trng/TRNGCC26X0.h>

TRNGCC26X0_Object trngCC26X2Objects[CC1350_BIOSENSE_HEADSET_TRNGCOUNT];

const TRNGCC26X0_HWAttrs trngCC26X2HWAttrs[CC1350_BIOSENSE_HEADSET_TRNGCOUNT] = {
    {
        .intPriority       = ~0,
        .swiPriority       = 0,
        .samplesPerCycle   = 240000,
    }
};

const TRNG_Config TRNG_config[CC1350_BIOSENSE_HEADSET_TRNGCOUNT] = {
    {
         .object  = &trngCC26X2Objects[CC1350_BIOSENSE_HEADSET_TRNG0],
         .hwAttrs = &trngCC26X2HWAttrs[CC1350_BIOSENSE_HEADSET_TRNG0]
    },
};

const uint_least8_t TRNG_count = CC1350_BIOSENSE_HEADSET_TRNGCOUNT;
#endif
/*
 *  =============================== Display ===============================
 */
#include <ti/display/Display.h>
#include <ti/display/DisplayUart.h>
#include <ti/display/DisplaySharp.h>

#ifndef BOARD_DISPLAY_UART_STRBUF_SIZE
#define BOARD_DISPLAY_UART_STRBUF_SIZE    128
#endif

/* This value can be changed to 96 for use with the 430BOOST-SHARP96 BoosterPack. */
#define BOARD_DISPLAY_SHARP_SIZE    128

DisplayUart_Object     displayUartObject;
DisplaySharp_Object    displaySharpObject;
#ifdef NEEDED
static char uartStringBuf[BOARD_DISPLAY_UART_STRBUF_SIZE];
#endif
static uint_least8_t sharpDisplayBuf[BOARD_DISPLAY_SHARP_SIZE * BOARD_DISPLAY_SHARP_SIZE / 8];
#ifdef NEEDED
const DisplayUart_HWAttrs displayUartHWAttrs = {
    .uartIdx      = CC1350_BIOSENSE_HEADSET_UART0,
    .baudRate     = 115200,
    .mutexTimeout = (unsigned int)(-1),
    .strBuf       = uartStringBuf,
    .strBufLen    = BOARD_DISPLAY_UART_STRBUF_SIZE,
};

const DisplaySharp_HWAttrsV1 displaySharpHWattrs = {
    .spiIndex    = CC1350_BIOSENSE_HEADSET_SPI2_TFT,
    .csPin       = CC1350_BIOSENSE_HEADSET_GPIO_LCD_CS,
    .powerPin    = CC1350_BIOSENSE_HEADSET_GPIO_LCD_POWER,
    .enablePin   = CC1350_BIOSENSE_HEADSET_GPIO_LCD_ENABLE,
    .pixelWidth  = BOARD_DISPLAY_SHARP_SIZE,
    .pixelHeight = BOARD_DISPLAY_SHARP_SIZE,
    .displayBuf  = sharpDisplayBuf,
};
#endif

#ifdef BOARD_DISPLAY_USE_UART
#define BOARD_DISPLAY_USE_UART 0
#endif
#ifndef BOARD_DISPLAY_USE_UART_ANSI
#define BOARD_DISPLAY_USE_UART_ANSI 0
#endif
#ifndef BOARD_DISPLAY_USE_LCD
#define BOARD_DISPLAY_USE_LCD 0
#endif

/*
 * This #if/#else is needed to workaround a problem with the
 * IAR compiler. The IAR compiler doesn't like the empty array
 * initialization. (IAR Error[Pe1345])
 */
#if (BOARD_DISPLAY_USE_UART || BOARD_DISPLAY_USE_LCD)

const Display_Config Display_config[] = {
#if (BOARD_DISPLAY_USE_UART)
    {
#  if (BOARD_DISPLAY_USE_UART_ANSI)
        .fxnTablePtr = &DisplayUartAnsi_fxnTable,
#  else /* Default to minimal UART with no cursor placement */
        .fxnTablePtr = &DisplayUartMin_fxnTable,
#  endif
        .object      = &displayUartObject,
        .hwAttrs     = &displayUartHWAttrs,
    },
#endif
#if (BOARD_DISPLAY_USE_LCD)
    {
        .fxnTablePtr = &DisplaySharp_fxnTable,
        .object      = &displaySharpObject,
        .hwAttrs     = &displaySharpHWattrs
    },
#endif
};

const uint_least8_t Display_count = sizeof(Display_config) / sizeof(Display_Config);

#else

const Display_Config *Display_config = NULL;
const uint_least8_t Display_count = 0;

#endif /* (BOARD_DISPLAY_USE_UART || BOARD_DISPLAY_USE_LCD) */

/*
 *  =============================== GPIO ===============================
 */
#include <ti/drivers/GPIO.h>
#include <ti/drivers/gpio/GPIOCC26XX.h>

/*
 * Array of Pin configurations
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in CC1350_BIOSENSE_HEADSET.h
 * NOTE: Pins not used for interrupts should be placed at the end of the
 *       array.  Callback entries can be omitted from callbacks array to
 *       reduce memory usage.
 */
GPIO_PinConfig gpioPinConfigs[] = {
    /* Output pins */
    CC1350_BIOSENSE_HEADSET_LED1 | GPIO_DO_NOT_CONFIG,  /* Green LED */
    CC1350_BIOSENSE_HEADSET_SW_PWR | GPIO_DO_NOT_CONFIG,  /* TMP116_EN */

    /* SPI MPU CSN */
    CC1350_BIOSENSE_HEADSET_MPU_CS | GPIO_DO_NOT_CONFIG,


    /* Sharp Display - GPIO configurations will be done in the Display files */
    CC1350_BIOSENSE_HEADSET_TFTCS | GPIO_DO_NOT_CONFIG, /* SPI chip select */
    CC1350_BIOSENSE_HEADSET_TFTRST | GPIO_DO_NOT_CONFIG, /* LCD power control */
    // TODO:
    //GPIOCC26XX_DIO_23 | GPIO_DO_NOT_CONFIG, /*LCD enable */
    CC1350_BIOSENSE_HEADSET_DC | GPIO_DO_NOT_CONFIG,

};

/*
 * Array of callback function pointers
 * NOTE: The order of the pin configurations must coincide with what was
 *       defined in CC1350_BIOSENSE_HEADSET.h
 * NOTE: Pins not used for interrupts can be omitted from callbacks array to
 *       reduce memory usage (if placed at end of gpioPinConfigs array).
 */
GPIO_CallbackFxn gpioCallbackFunctions[] = {
    NULL,  /*  Button 0 */
    NULL,  /*  Button 1 */
    NULL,  /* CC1350_BIOSENSE_HEADSET_SPI_MASTER_READY */
    NULL,  /* CC1350_BIOSENSE_HEADSET_SPI_SLAVE_READY */
};

const GPIOCC26XX_Config GPIOCC26XX_config = {
    .pinConfigs = (GPIO_PinConfig *)gpioPinConfigs,
    .callbacks = (GPIO_CallbackFxn *)gpioCallbackFunctions,
    .numberOfPinConfigs = sizeof(gpioPinConfigs)/sizeof(GPIO_PinConfig),
    .numberOfCallbacks = sizeof(gpioCallbackFunctions)/sizeof(GPIO_CallbackFxn),
    .intPriority = (~0)
};

