Biosense-Capstone/SPIMASTER/CC1350_BIOSENSE_HEADSET.c
/* NVS Region index 0 and 1 refer to NVS and NVS SPI respectively */
const NVS_Config NVS_config[CC1350_BIOSENSE_HEADSET_NVSCOUNT] = {
#ifndef Board_EXCLUDE_NVS_INTERNAL_FLASH
    {
        .fxnTablePtr = &NVSCC26XX_fxnTable,
        .object = &nvsCC26xxObjects[0],
        .hwAttrs = &nvsCC26xxHWAttrs[0],
    },
#endif
#ifndef Board_EXCLUDE_NVS_EXTERNAL_FLASH
    {
        .fxnTablePtr = &NVSSPI25X_fxnTable,
        .object = &nvsSPI25XObjects[0],
        .hwAttrs = &nvsSPI25XHWAttrs[0],
    },
#endif
};

const uint_least8_t NVS_count = CC1350_BIOSENSE_HEADSET_NVSCOUNT;
#endif
/*
 *  =============================== PIN ===============================
 */
#include <ti/drivers/PIN.h>
#include <ti/drivers/pin/PINCC26XX.h>

const PIN_Config BoardGpioInitTable[] = {
#ifdef NEEDED
    CC1350_BIOSENSE_HEADSET_PIN_RLED | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,          /* LED initially off             */
#endif
    CC1350_BIOSENSE_HEADSET_PIN_GLED | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,          /* LED initially off             */
#ifdef NEEDED
    CC1350_BIOSENSE_HEADSET_PIN_BTN1 | PIN_INPUT_EN | PIN_PULLUP | PIN_IRQ_BOTHEDGES | PIN_HYSTERESIS,             /* Button is active low          */
    CC1350_BIOSENSE_HEADSET_PIN_BTN2 | PIN_INPUT_EN | PIN_PULLUP | PIN_IRQ_BOTHEDGES | PIN_HYSTERESIS,             /* Button is active low          */
#endif
    CC1350_BIOSENSE_HEADSET_MPU_CS | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL | PIN_DRVSTR_MIN,     /* External flash chip select    */
#ifdef NEEDED
    CC1350_BIOSENSE_HEADSET_UART_RX | PIN_INPUT_EN | PIN_PULLDOWN,                                                 /* UART RX via debugger back channel */
    CC1350_BIOSENSE_HEADSET_UART_TX | PIN_GPIO_OUTPUT_EN | PIN_GPIO_HIGH | PIN_PUSHPULL,                           /* UART TX via debugger back channel */
#endif
    CC1350_BIOSENSE_HEADSET_DIO1_RF_SUB1GHZ   | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX, /* RF SW Switch defaults to 2.4 GHz path*/
    CC1350_BIOSENSE_HEADSET_DIO30_RF_POWER | PIN_GPIO_OUTPUT_EN | PIN_GPIO_LOW | PIN_PUSHPULL | PIN_DRVSTR_MAX,    /* External RF Switch is powered off by default */
    CC1350_BIOSENSE_HEADSET_SPI0_MOSI | PIN_INPUT_EN | PIN_PULLDOWN,                                               /* SPI master out - slave in */
    CC1350_BIOSENSE_HEADSET_SPI0_MISO | PIN_INPUT_EN | PIN_PULLDOWN,                                               /* SPI master in - slave out */
    CC1350_BIOSENSE_HEADSET_SPI0_CLK | PIN_INPUT_EN | PIN_PULLDOWN,                                                /* SPI clock */
    PIN_TERMINATE
};

const PINCC26XX_HWAttrs PINCC26XX_hwAttrs = {
    .intPriority = ~0,
    .swiPriority = 0
};

/*
 *  =============================== Power ===============================
 */
#include <ti/drivers/Power.h>
#include <ti/drivers/power/PowerCC26XX.h>

const PowerCC26XX_Config PowerCC26XX_config = {
    .policyInitFxn      = NULL,
    .policyFxn          = &PowerCC26XX_standbyPolicy,
    .calibrateFxn       = &PowerCC26XX_calibrate,
    .enablePolicy       = true,
    .calibrateRCOSC_LF  = true,
    .calibrateRCOSC_HF  = true,
};

/*
 *  =============================== PWM ===============================
 *  Remove unused entries to reduce flash usage both in Board.c and Board.h
 */
#include <ti/drivers/PWM.h>
#include <ti/drivers/pwm/PWMTimerCC26XX.h>

PWMTimerCC26XX_Object pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADSET_PWMCOUNT];

const PWMTimerCC26XX_HwAttrs pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADSET_PWMCOUNT] = {
    { .pwmPin = CC1350_BIOSENSE_HEADSET_PWMPIN1, .gpTimerUnit = CC1350_BIOSENSE_HEADSET_GPTIMER0B },
    { .pwmPin = CC1350_BIOSENSE_HEADSET_PWMPIN2, .gpTimerUnit = CC1350_BIOSENSE_HEADSET_GPTIMER1A },
    { .pwmPin = CC1350_BIOSENSE_HEADSET_PWMPIN3, .gpTimerUnit = CC1350_BIOSENSE_HEADSET_GPTIMER1B },
    { .pwmPin = CC1350_BIOSENSE_HEADSET_PWMPIN4, .gpTimerUnit = CC1350_BIOSENSE_HEADSET_GPTIMER2A },
    { .pwmPin = CC1350_BIOSENSE_HEADSET_PWMPIN5, .gpTimerUnit = CC1350_BIOSENSE_HEADSET_GPTIMER2B },
    { .pwmPin = CC1350_BIOSENSE_HEADSET_PWMPIN6, .gpTimerUnit = CC1350_BIOSENSE_HEADSET_GPTIMER3A },
    { .pwmPin = CC1350_BIOSENSE_HEADSET_PWMPIN7, .gpTimerUnit = CC1350_BIOSENSE_HEADSET_GPTIMER3B },
};

const PWM_Config PWM_config[CC1350_BIOSENSE_HEADSET_PWMCOUNT] = {
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADSET_PWM1], &pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADSET_PWM1] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADSET_PWM2], &pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADSET_PWM2] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADSET_PWM3], &pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADSET_PWM3] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADSET_PWM4], &pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADSET_PWM4] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADSET_PWM5], &pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADSET_PWM5] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADSET_PWM6], &pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADSET_PWM6] },
    { &PWMTimerCC26XX_fxnTable, &pwmtimerCC26xxObjects[CC1350_BIOSENSE_HEADSET_PWM7], &pwmtimerCC26xxHWAttrs[CC1350_BIOSENSE_HEADSET_PWM7] },
};

const uint_least8_t PWM_count = CC1350_BIOSENSE_HEADSET_PWMCOUNT;

/*
 *  =============================== RF Driver ===============================
 */
#include <ti/drivers/rf/RF.h>

/*
 *  Board-specific callback function to set the correct antenna path.
 *
 *  This function is called by the RF driver on global driver events.
 *  It contains a default implementation to set the correct antenna path.
 *  This function is defined in the file CC1350_BIOSENSE_HEADSET_fxns.c
 */
extern void rfDriverCallback(RF_Handle client, RF_GlobalEvent events, void *arg);

const RFCC26XX_HWAttrsV2 RFCC26XX_hwAttrs = {
    .hwiPriority        = ~0,     /* Lowest HWI priority */
    .swiPriority        = 0,      /* Lowest SWI priority */
    .xoscHfAlwaysNeeded = true,   /* Keep XOSC dependency while in standby */

    /* Register the board specific callback */
    .globalCallback     = &rfDriverCallback,
    /* Subscribe the callback to both events */
    .globalEventMask    = RF_GlobalEventRadioSetup | RF_GlobalEventRadioPowerDown
};

