Biosense-Capstone/SPIMASTER/CC1350_BIOSENSE_HEADSET.c
/*
 *  =============================== SD ===============================
 */
#ifdef NEEDED
#include <ti/drivers/SD.h>

#include <ti/drivers/sd/SDSPI.h>

SDSPI_Object sdspiObjects[CC1350_BIOSENSE_HEADSET_SDCOUNT];

const SDSPI_HWAttrs sdspiHWAttrs[CC1350_BIOSENSE_HEADSET_SDCOUNT] = {
    {
        .spiIndex = CC1350_BIOSENSE_HEADSET_SPI0,
        .spiCsGpioIndex = CC1350_BIOSENSE_HEADSET_SDSPI_CS
    }
};

const SD_Config SD_config[CC1350_BIOSENSE_HEADSET_SDCOUNT] = {
    {
        .fxnTablePtr = &SDSPI_fxnTable,
        .object = &sdspiObjects[CC1350_BIOSENSE_HEADSET_SDSPI0],
        .hwAttrs = &sdspiHWAttrs[CC1350_BIOSENSE_HEADSET_SDSPI0]
    },
};

const uint_least8_t SD_count = CC1350_BIOSENSE_HEADSET_SDCOUNT;
#endif
/*
 *  =============================== SPI DMA ===============================
 */
#include <ti/drivers/SPI.h>
#include <ti/drivers/spi/SPICC26XXDMA.h>

SPICC26XXDMA_Object spiCC26XXDMAObjects[CC1350_BIOSENSE_HEADSET_SPICOUNT];

/*
 * NOTE: The SPI instances below can be used by the SD driver to communicate
 * with a SD card via SPI.  The 'defaultTxBufValue' fields below are set to 0xFF
 * to satisfy the SDSPI driver requirement.
 */
const SPICC26XXDMA_HWAttrsV1 spiCC26XXDMAHWAttrs[CC1350_BIOSENSE_HEADSET_SPICOUNT] = {
    {
        .baseAddr           = SSI0_BASE,
        .intNum             = INT_SSI0_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI0,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI0_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI0_TX,
        .mosiPin            = CC1350_BIOSENSE_HEADSET_SPI0_MOSI,
        .misoPin            = CC1350_BIOSENSE_HEADSET_SPI0_MISO,
        .clkPin             = CC1350_BIOSENSE_HEADSET_SPI0_CLK,
        .csnPin             = CC1350_BIOSENSE_HEADSET_SPI0_CSN,
        .minDmaTransferSize = 10
    },
    {
        .baseAddr           = SSI1_BASE,
        .intNum             = INT_SSI1_COMB,
        .intPriority        = ~0,
        .swiPriority        = 0,
        .powerMngrId        = PowerCC26XX_PERIPH_SSI1,
        .defaultTxBufValue  = 0xFF,
        .rxChannelBitMask   = 1<<UDMA_CHAN_SSI1_RX,
        .txChannelBitMask   = 1<<UDMA_CHAN_SSI1_TX,
        .mosiPin            = CC1350_BIOSENSE_HEADSET_SPI1_MOSI,
        .misoPin            = CC1350_BIOSENSE_HEADSET_SPI1_MISO,
        .clkPin             = CC1350_BIOSENSE_HEADSET_SPI1_CLK,
        .csnPin             = CC1350_BIOSENSE_HEADSET_SPI1_CSN,
        .minDmaTransferSize = 10
    }
};

const SPI_Config SPI_config[CC1350_BIOSENSE_HEADSET_SPICOUNT] = {
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[CC1350_BIOSENSE_HEADSET_SPI0],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[CC1350_BIOSENSE_HEADSET_SPI0]
    },
    {
         .fxnTablePtr = &SPICC26XXDMA_fxnTable,
         .object      = &spiCC26XXDMAObjects[CC1350_BIOSENSE_HEADSET_SPI1],
         .hwAttrs     = &spiCC26XXDMAHWAttrs[CC1350_BIOSENSE_HEADSET_SPI1]
    },
};

const uint_least8_t SPI_count = CC1350_BIOSENSE_HEADSET_SPICOUNT;
#ifdef NEEDED
/*
 *  =============================== UART ===============================
 */
#include <ti/drivers/UART.h>
#include <ti/drivers/uart/UARTCC26XX.h>

UARTCC26XX_Object uartCC26XXObjects[CC1350_BIOSENSE_HEADSET_UARTCOUNT];

uint8_t uartCC26XXRingBuffer[CC1350_BIOSENSE_HEADSET_UARTCOUNT][32];

const UARTCC26XX_HWAttrsV2 uartCC26XXHWAttrs[CC1350_BIOSENSE_HEADSET_UARTCOUNT] = {
    {
        .baseAddr       = UART0_BASE,
        .powerMngrId    = PowerCC26XX_PERIPH_UART0,
        .intNum         = INT_UART0_COMB,
        .intPriority    = ~0,
        .swiPriority    = 0,
        .txPin          = CC1350_BIOSENSE_HEADSET_UART_TX,
        .rxPin          = CC1350_BIOSENSE_HEADSET_UART_RX,
        .ctsPin         = PIN_UNASSIGNED,
        .rtsPin         = PIN_UNASSIGNED,
        .ringBufPtr     = uartCC26XXRingBuffer[CC1350_BIOSENSE_HEADSET_UART0],
        .ringBufSize    = sizeof(uartCC26XXRingBuffer[CC1350_BIOSENSE_HEADSET_UART0]),
        .txIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_1_8,
        .rxIntFifoThr   = UARTCC26XX_FIFO_THRESHOLD_4_8,
        .errorFxn       = NULL
    }
};

const UART_Config UART_config[CC1350_BIOSENSE_HEADSET_UARTCOUNT] = {
    {
        .fxnTablePtr = &UARTCC26XX_fxnTable,
        .object      = &uartCC26XXObjects[CC1350_BIOSENSE_HEADSET_UART0],
        .hwAttrs     = &uartCC26XXHWAttrs[CC1350_BIOSENSE_HEADSET_UART0]
    },
};

const uint_least8_t UART_count = CC1350_BIOSENSE_HEADSET_UARTCOUNT;
#endif
/*
 *  =============================== UDMA ===============================
 */
#include <ti/drivers/dma/UDMACC26XX.h>

UDMACC26XX_Object udmaObjects[CC1350_BIOSENSE_HEADSET_UDMACOUNT];

const UDMACC26XX_HWAttrs udmaHWAttrs[CC1350_BIOSENSE_HEADSET_UDMACOUNT] = {
    {
        .baseAddr    = UDMA0_BASE,
        .powerMngrId = PowerCC26XX_PERIPH_UDMA,
        .intNum      = INT_DMA_ERR,
        .intPriority = ~0
    }
};

const UDMACC26XX_Config UDMACC26XX_config[CC1350_BIOSENSE_HEADSET_UDMACOUNT] = {
    {
         .object  = &udmaObjects[CC1350_BIOSENSE_HEADSET_UDMA0],
         .hwAttrs = &udmaHWAttrs[CC1350_BIOSENSE_HEADSET_UDMA0]
    },
};

/*
 *  =============================== Watchdog ===============================
 */
#include <ti/drivers/Watchdog.h>
#include <ti/drivers/watchdog/WatchdogCC26XX.h>

WatchdogCC26XX_Object watchdogCC26XXObjects[CC1350_BIOSENSE_HEADSET_WATCHDOGCOUNT];

const WatchdogCC26XX_HWAttrs watchdogCC26XXHWAttrs[CC1350_BIOSENSE_HEADSET_WATCHDOGCOUNT] = {
    {
        .baseAddr    = WDT_BASE,
        .reloadValue = 1000 /* Reload value in milliseconds */
    },
};

const Watchdog_Config Watchdog_config[CC1350_BIOSENSE_HEADSET_WATCHDOGCOUNT] = {
    {
        .fxnTablePtr = &WatchdogCC26XX_fxnTable,
        .object      = &watchdogCC26XXObjects[CC1350_BIOSENSE_HEADSET_WATCHDOG0],
        .hwAttrs     = &watchdogCC26XXHWAttrs[CC1350_BIOSENSE_HEADSET_WATCHDOG0]
    },
};

const uint_least8_t Watchdog_count = CC1350_BIOSENSE_HEADSET_WATCHDOGCOUNT;

/*
 *  Board-specific initialization function to disable external flash.
 *  This function is defined in the file CC1350_BIOSENSE_HEADSET_fxns.c
 */
extern void Board_initHook(void);

/*
 *  ======== CC1350_BIOSENSE_HEADSET_initGeneral ========
 */
void CC1350_BIOSENSE_HEADSET_initGeneral(void)
{
    Power_init();

    if (PIN_init(BoardGpioInitTable) != PIN_SUCCESS) {
        /* Error with PIN_init */
        while (1);
    }

    /* Perform board-specific initialization */
    Board_initHook();
}
